{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.5", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "padding": "same", "activation": "relu", "kernel_size": [5, 5], "data_format": "channels_first", "batch_input_shape": [null, 1, 192, 192], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_2", "filters": 32, "padding": "same", "activation": "relu", "kernel_size": [5, 5], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_3", "filters": 32, "padding": "same", "activation": "relu", "kernel_size": [5, 5], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_4", "filters": 64, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_5", "filters": 64, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_6", "filters": 64, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_7", "filters": 128, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_8", "filters": 128, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_9", "filters": 128, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_10", "filters": 128, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_11", "filters": 128, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_12", "filters": 128, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_first", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "units": 128, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "units": 64, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_3", "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "units": 6, "activity_regularizer": null}}]}